'use script'

let quiz = [
{
	'q': 'Какой ваш любимый цвет?',
	'a': {
		
		'ca': 'Желтый',
		'sw': 'Розовый',
		'h': 'Фиолетовый',
		'ds': 'Голубой',
		'im': 'Зеленый',
		'bw': 'Оранжевый',
		'hk': 'Черный',
		'sm': 'Пупурный',
		't': 'Красный',
		
	}
},

{
	'q': 'Какая черта характера вас олицетворяет?',
	'a': {
		'im': 'Ответсвенность',
		't': 'Высокомерие',
		'ca': 'Смелость',
		'h': 'Импульсивность',
		'bw': 'Открытость',
		'hk': 'Бесстрашие',
		'ds': 'Рассудительность',
		'sw': 'Заботливость',
		'sm': 'Сообразительность',
		
	}
},

{
	'q': 'Выберите предложение, которое лучше всего вас описывает:',
	'a': {
		'ca': 'Терпение и целестремленность',
		'h': 'Сила и ум',
		'im': 'Остроумие и чувтсво юмора',
		'hk': 'Смелость и решительность',
		'bw': 'Самопожертвование и отвага',
		'sm': 'Активность и неуклюжесть',
		'ds': 'Скромность и рассудительность',
		't': 'Ранимость и жертвенность',
		'sw': 'Вспыльчивость и привязанность',
		
	}
},

{
	'q': 'Какое ваше главное преимущество?',
	'a': {
		't': 'Неуязвимость',
		'im': 'Ум',
		'ca': 'Лидерские качества',
		'h': 'Сила',
		'bw': 'Самопожертвование',
		'hk': 'Смелость',
		't': 'Неуязвимость',
		'sw': 'Скрытые способности',
		'ds': 'Хлоднокровность',
		
	}
},

{
	'q': 'Какую суперсилу вы бы выбрали?',
	'a': {
		'h': 'Неограниченная мощь',
		'im': 'Уникальный ум',
		'ca': 'Универсальный солдат',
		'hk': 'Меткость',
		'bw': 'Супершпион',
		'ds': 'Управление временем',
		'sm': 'Ловкость и сила',
		't': 'Неуязвимость',
		'sw': 'Безграничная сила',
		
	}
},

{
	'q': 'Кем  бы вы хотели стать в будующем?',
	'a': {
		'im': 'Изобретателем',
		'ca': 'Солдатом',
		'h': 'Ученым',
		'bw': 'Шпионом',
		'hk': 'Стрелком',
		'sm': 'Студентом',
		't': 'Инопланетянином',
		'ds': 'Хирургом',
		'sw': 'Магом',
		
	}
},

{
	'q': 'Кого бы вы взяли к себе в напарники?',
	'a': {
		'im': 'Воитель',
		'h': 'Тони Старк',
		'ds': 'Вонг',
		'ca': 'Сокол',
		'bw': 'Соколиный глаз',
		'hk': 'Черная вдова',
		't': 'Локи',
		'sw': 'Ртуть',
		'sm': 'Железный человек',
		
	}
},

{
	'q': 'Выберите из списка лишнее:',
	'a': {
		'ca': 'Смелость',
		'im': 'Самопожертвование',
		'bw': 'Решительность',
		'hk': 'Отвага',
		'h': 'Лидерство',
		't': 'Взаимовыручка',
		'ds': 'Альтруизм',
		'sw': 'Храбрость',
		'sm': 'Уверенность',
		
	}
},

{
	'q': 'Какое ваше тотемное животное?',
	'a': {
		'im': 'Олень',
		'ca': 'Дятел',
		'h': 'Медведь',
		'bw': 'Сова',
		'hk': 'Выдра',
		'sm': 'Ворон',
		't': 'Змея',
		'ds': 'Ящер',
		'sw': 'Сокол',
		
	}
},

{
	'q': 'Кому вы больше всего доверяете?',
	'a': {
		'sm': 'Человек паук',
		'ds': 'Доктор Стрендж',
		'hk': 'Соколиный глаз',
		'h': 'Халк',
		'bw': 'Черная вдова',
		't': 'Тор',
		'ca': 'Капитан Америка',
		'im': 'Железный человек',
		'sw': 'Алая ведьма',
		
	}
},

];